# Before you start:
- Read the README.md file
- Comment as much as you can and use the resources (README.md file)
- Happy learning!

In [24]:
# import numpy and pandas
import pandas as pd
import numpy as np
import scipy.stats as st
from scipy import stats

# Challenge 1 - Exploring the Data

In this challenge, we will examine all salaries of employees of the City of Chicago. We will start by loading the dataset and examining its contents.

In [2]:
# Your code here:
data = pd.read_csv('Current_Employee_Names__Salaries__and_Position_Titles.csv')
display(data.shape)
display(data.head(2))
display(data.tail())

(33702, 8)

,Name,Job Titles,Department,Full or Part-Time,Salary or Hourly,Typical Hours,Annual Salary,Hourly Rate
0,"ADRIANO, RACQUEL ANNE",PARAMEDIC,FIRE,F,Salary,NaN,72510.0,NaN
1,"AFFANEH, MAHIR A",POLICE OFFICER,POLICE,F,Salary,NaN,93354.0,NaN

,Name,Job Titles,Department,Full or Part-Time,Salary or Hourly,Typical Hours,Annual Salary,Hourly Rate
33697,"ZYLINSKA, KLAUDIA",POLICE OFFICER,POLICE,F,Salary,NaN,72510.0,NaN
33698,"ZYMANTAS, LAURA C",POLICE OFFICER,POLICE,F,Salary,NaN,76266.0,NaN
33699,"ZYMANTAS, MARK E",POLICE OFFICER,POLICE,F,Salary,NaN,90024.0,NaN
33700,"ZYRKOWSKI, CARLO E",POLICE OFFICER,POLICE,F,Salary,NaN,93354.0,NaN
33701,"ZYSKOWSKI, DARIUSZ",CHIEF DATA BASE ANALYST,DAIS,F,Salary,NaN,126732.0,NaN

Examine the `salaries` dataset using the `head` function below.

In [13]:
# Your code here:
data.head()

,name,job_titles,department,full_or_part-time,salary_or_hourly,typical_hours,annual_salary,hourly_rate
0,"ADRIANO, RACQUEL ANNE",PARAMEDIC,FIRE,F,Salary,NaN,72510.0,NaN
1,"AFFANEH, MAHIR A",POLICE OFFICER,POLICE,F,Salary,NaN,93354.0,NaN
2,"AFOENYI, PHYLLIS",TITLE V PROGRAM TRAINEE I,FAMILY & SUPPORT,P,Hourly,20.0,NaN,13.0
3,"AGAR, BULENT B",DEPUTY COMMISSIONER,WATER MGMNT,F,Salary,NaN,132972.0,NaN
4,"AGEE, LAWRENCE",POLICE OFFICER,POLICE,F,Salary,NaN,90024.0,NaN

We see from looking at the `head` function that there is quite a bit of missing data. Let's examine how much missing data is in each column. Produce this output in the cell below

In [14]:
# Your code here:
data.isna().sum()

name                     0
job_titles               0
department               0
full_or_part-time        0
salary_or_hourly         0
typical_hours        25528
annual_salary         8174
hourly_rate          25528
dtype: int64

Let's also look at the count of hourly vs. salaried employees. Write the code in the cell below

In [11]:
def standardise_header(data): # ALL THE COLUMNS HEADER ARE CORRECTED TO ACCESS EASILY IN FURTHER STEPS
    data.columns = [c.lower().replace(' ', '_') for c in data.columns]

standardise_header(data)

In [12]:
# Your code here:

data['salary_or_hourly'].value_counts()

Salary    25528
Hourly     8174
Name: salary_or_hourly, dtype: int64

What this information indicates is that the table contains information about two types of employees - salaried and hourly. Some columns apply only to one type of employee while other columns only apply to another kind. This is why there are so many missing values. Therefore, we will not do anything to handle the missing values.

There are different departments in the city. List all departments and the count of employees in each department.

In [18]:
# Your code here:
df = data.groupby('department').agg({'name': 'count'})
df.rename(columns={'name': 'Number of Employees'}, inplace=True)
df = df.reset_index()
df

             department  Number of Employees
0          ADMIN HEARNG                   38
1         ANIMAL CONTRL                   75
2              AVIATION                 1856
3     BOARD OF ELECTION                  111
4       BOARD OF ETHICS                    8
5         BUDGET & MGMT                   44
6             BUILDINGS                  258
7      BUSINESS AFFAIRS                  167
8            CITY CLERK                   88
9          CITY COUNCIL                  362
10                 COPA                  123
11     CULTURAL AFFAIRS                   74
12                 DAIS                 1033
13         DISABILITIES                   28
14     FAMILY & SUPPORT                  656
15              FINANCE                  544
16                 FIRE                 4627
17               HEALTH                  467
18              HOUSING                   66
19   HOUSING & ECON DEV                  154
20      HUMAN RELATIONS                   17
21      HUMAN RESOURCES                   75
22        INSPECTOR GEN                   95
23                  LAW                  398
24    LICENSE APPL COMM                    1
25       MAYOR'S OFFICE                  104
26                 OEMC                 1737
27               POLICE                13848
28         POLICE BOARD                    2
29          PROCUREMENT                   84
30       PUBLIC LIBRARY                 1088
31  PUBLIC SAFETY ADMIN                  244
32        STREETS & SAN                 2175
33           TRANSPORTN                 1113
34            TREASURER                   28
35          WATER MGMNT                 1914

In [21]:
# Before starting the hypothesis test on a particular target, lets drop the nan values:
data_df = data['hourly_rate'].dropna()

In [22]:
data_df.head(2)

2    13.00
5    37.45
Name: hourly_rate, dtype: float64

In [23]:
data_df.isna().sum()

0

In [ ]:
# There is no nan values now.

# Challenge 2 - Hypothesis Tests

In this section of the lab, we will test whether the hourly wage of all hourly workers is significantly different from $30/hr. Import the correct one sample test function from scipy and perform the hypothesis test for a 95% two sided confidence interval.

# Hypothesis:
#H0 is that the hourly salary is equal to 30$

#H1 is that the hourly salary is significantly different from 30$

In [30]:
# Your code here:

import scipy.stats 
from scipy import stats
hourly_rate = data_df
confidence_level = 0.95
degrees_freedom = len(hourly_rate) - 1 
sample_mean = np.mean(hourly_rate)
sample_standard_error = scipy.stats.sem(hourly_rate) 
confidence_interval = scipy.stats.t.interval(confidence_level, 
                                             degrees_freedom, 
                                             sample_mean, 
                                             sample_standard_error)

In [32]:
display(confidence_interval)

(34.29839539204361, 34.874504045197305)

In [33]:
from scipy.stats import ttest_1samp
stat, pval = ttest_1samp(data_df, 30)

In [34]:
stat

31.211500329216044

In [35]:
pval

3.825475847673794e-202

In [36]:
#30$/hr salary is outside our confidence interval from more than 10 % with confidence_level = 0.95

In [37]:
Result = "Based on the analysis, it can be concluded that the Null Hypothesis (that the hourly wage of all hourly workers is equal to $30/hr) cannot be supported due to the low p-value (less than 0.05). Thus, it must be rejected and it can be determined that the hourly wage of all hourly workers is significantly different from $30/hr."

In [38]:
Result

'Based on the analysis, it can be concluded that the Null Hypothesis (that the hourly wage of all hourly workers is equal to $30/hr) cannot be supported due to the low p-value (less than 0.05). Thus, it must be rejected and it can be determined that the hourly wage of all hourly workers is significantly different from $30/hr.'

We are also curious about salaries in the police force. The chief of police in Chicago claimed in a press briefing that salaries this year are higher than last year's mean of $86000/year a year for all salaried employees. Test this one sided hypothesis using a 95% confidence interval.

Hint: A one tailed test has a p-value that is half of the two tailed p-value. If our hypothesis is greater than, then to reject, the test statistic must also be positive.

In [40]:
# Your code here:
data_police = data[(data['department'] == 'POLICE') & (data['annual_salary'].isnull() == False)]

In [44]:
data_police.head(5)

,name,job_titles,department,full_or_part-time,salary_or_hourly,typical_hours,annual_salary,hourly_rate
1,"AFFANEH, MAHIR A",POLICE OFFICER,POLICE,F,Salary,NaN,93354.0,NaN
4,"AGEE, LAWRENCE",POLICE OFFICER,POLICE,F,Salary,NaN,90024.0,NaN
6,"AGNEW, MELISSA M",SERGEANT,POLICE,F,Salary,NaN,111444.0,NaN
7,"AGOSTA, JOSEPH J",POLICE OFFICER (ASSIGNED AS DETECTIVE),POLICE,F,Salary,NaN,103932.0,NaN
9,"AGOSTINI, LUIS R",ASST DIR,POLICE,F,Salary,NaN,95736.0,NaN

In [45]:
df1 = data_police['annual_salary']

In [47]:
df1.isna().sum()

0

#

In [48]:
# Your code here:

annual_salary = df1
confidence_level = 0.95
degrees_freedom = len(annual_salary) - 1 
sample_mean = np.mean(annual_salary)
sample_standard_error = scipy.stats.sem(annual_salary) 
confidence_interval = scipy.stats.t.interval(confidence_level, 
                                             degrees_freedom, 
                                             sample_mean, 
                                             sample_standard_error)

In [49]:
confidence_interval

(88534.1182885883, 89134.11955863392)

In [50]:
from scipy.stats import ttest_1samp
stat, pval = ttest_1samp(df1, 86000)

In [53]:
stat

18.51748561981861

In [54]:
pval

1.2239133904242963e-75

In [55]:
Result_police = "The Null Hypothesis (that annual salaries in the police department are less than or equal to $86,000) can be rejected based on the low p-value (less than 0.05). Furthermore, it can be concluded that these salaries are higher, as evidenced by the positive t-statistic and a 95% confidence interval of $88,500 to $89,100."

In [56]:
Result_police

'The Null Hypothesis (that annual salaries in the police department are less than or equal to $86,000) can be rejected based on the low p-value (less than 0.05). Furthermore, it can be concluded that these salaries are higher, as evidenced by the positive t-statistic and a 95% confidence interval of $88,500 to $89,100.'

# Using the crosstab function, find the department that has the most hourly workers.

The workers from the department with the most hourly workers have complained that their hourly wage is less than $35/hour. Using a one sample t-test, test this one-sided hypothesis at the 95% confidence level.

In [57]:
#Hypothesis:
#H0 is that the hourly wage for the STREETS & SAN department is higher than or equal to 35$/hr
#H1 is that the hourly wage for the STREETS & SAN department is less than 35$/hr

In [58]:
# Your code here:
data_dep = data[(data['department'] == 'STREETS & SAN') & (data['hourly_rate'].isnull() == False)]

In [59]:
data_dep

,name,job_titles,department,full_or_part-time,salary_or_hourly,typical_hours,annual_salary,hourly_rate
15,"AGSALUD, FERNAN S",SANITATION LABORER,STREETS & SAN,F,Hourly,40.0,NaN,40.78
16,"AGSALUD JR, JUANITO S",SANITATION LABORER,STREETS & SAN,F,Hourly,40.0,NaN,38.52
26,"AGUILAR, EFRAIN",SANITATION LABORER,STREETS & SAN,F,Hourly,40.0,NaN,38.52
49,"ABDUL-SHAKUR, TAHIR J",POOL MOTOR TRUCK DRIVER,STREETS & SAN,P,Hourly,10.0,NaN,29.96
65,"ABRAMS, SAMUEL A",POOL MOTOR TRUCK DRIVER,STREETS & SAN,F,Hourly,40.0,NaN,37.45
...,...,...,...,...,...,...,...,...
33623,"ZIZUMBO, JOSE N",MOTOR TRUCK DRIVER,STREETS & SAN,F,Hourly,40.0,NaN,38.01
33624,"ZIZUMBO, LUIS",MOTOR TRUCK DRIVER,STREETS & SAN,F,Hourly,40.0,NaN,37.45
33667,"ZUMMO, ROBERT J",MOTOR TRUCK DRIVER,STREETS & SAN,F,Hourly,40.0,NaN,37.45
33668,"ZUNICH, JONATHAN G",SANITATION LABORER,STREETS & SAN,F,Hourly,40.0,NaN,38.52
33676,"ZUNIGA, THOMAS",GENERAL LABORER - DSS,STREETS & SAN,F,Hourly,40.0,NaN,25.95

In [60]:
df2 = data_dep['hourly_rate']
df2

15       40.78
16       38.52
26       38.52
49       29.96
65       37.45
         ...
33623    38.01
33624    37.45
33667    37.45
33668    38.52
33676    25.95
Name: hourly_rate, Length: 1846, dtype: float64

In [61]:
hourly_rate2 = df2
confidence_level = 0.95
degrees_freedom = len(hourly_rate2) - 1 
sample_mean = np.mean(hourly_rate2)
sample_standard_error = scipy.stats.sem(hourly_rate2) 
confidence_interval = scipy.stats.t.interval(confidence_level, 
                                             degrees_freedom, 
                                             sample_mean, 
                                             sample_standard_error)

In [62]:
confidence_interval

(35.28150811892018, 35.82308559722106)

In [63]:
from scipy.stats import ttest_1samp
stat, pval = ttest_1samp(df2, 35)

In [64]:
stat

4.000138803968834

In [66]:
pval/2

3.2902372218867895e-05

In [67]:
result_dep = "We accept the Null Hypothesis (that hourly wages for the STREETS & SAN department are higher than $35/hr) and reject the alternative hypothesis that they are equal. This is due to a low p-value (less than 0.05) and a positive t-statistic. The evidence suggests that these wages are higher, with a 95% confidence interval of $35.20 to $35.82/hr."

In [68]:
result_dep

'We accept the Null Hypothesis (that hourly wages for the STREETS & SAN department are higher than $35/hr) and reject the alternative hypothesis that they are equal. This is due to a low p-value (less than 0.05) and a positive t-statistic. The evidence suggests that these wages are higher, with a 95% confidence interval of $35.20 to $35.82/hr.'

# Challenge 3: To practice - Constructing Confidence Intervals

While testing our hypothesis is a great way to gather empirical evidence for accepting or rejecting the hypothesis, another way to gather evidence is by creating a confidence interval. A confidence interval gives us information about the true mean of the population. So for a 95% confidence interval, we are 95% sure that the mean of the population is within the confidence interval. 
).

To read more about confidence intervals, click [here](https://en.wikipedia.org/wiki/Confidence_interval).


In the cell below, we will construct a 95% confidence interval for the mean hourly wage of all hourly workers. 

The confidence interval is computed in SciPy using the `t.interval` function. You can read more about this function [here](https://docs.scipy.org/doc/scipy-0.14.0/reference/generated/scipy.stats.t.html).

To compute the confidence interval of the hourly wage, use the 0.95 for the confidence level, number of rows - 1 for degrees of freedom, the mean of the sample for the location parameter and the standard error for the scale. The standard error can be computed using [this](https://docs.scipy.org/doc/scipy/reference/generated/scipy.stats.sem.html) function in SciPy.

In [69]:
# Your code here:

hourly_rate = data_df
confidence_level = 0.95
degrees_freedom = len(hourly_rate) - 1 
sample_mean = np.mean(hourly_rate)
sample_standard_error = scipy.stats.sem(hourly_rate) 
confidence_interval = scipy.stats.t.interval(confidence_level, 
                                             degrees_freedom, 
                                             sample_mean, 
                                             sample_standard_error)

In [70]:
confidence_interval

(34.29839539204361, 34.874504045197305)

Now construct the 95% confidence interval for all salaried employeed in the police in the cell below.

In [71]:
# Your code here:
annual_salary = df1
confidence_level = 0.95
degrees_freedom = len(annual_salary) - 1 
sample_mean = np.mean(annual_salary)
sample_standard_error = scipy.stats.sem(annual_salary) 
confidence_interval = scipy.stats.t.interval(confidence_level, 
                                             degrees_freedom, 
                                             sample_mean, 
                                             sample_standard_error)

In [72]:
confidence_interval

(88534.1182885883, 89134.11955863392)

# Bonus Challenge - Hypothesis Tests of Proportions

Another type of one sample test is a hypothesis test of proportions. In this test, we examine whether the proportion of a group in our sample is significantly different than a fraction. 

You can read more about one sample proportion tests [here](http://sphweb.bumc.bu.edu/otlt/MPH-Modules/BS/SAS/SAS6-CategoricalData/SAS6-CategoricalData2.html).

In the cell below, use the `proportions_ztest` function from `statsmodels` to perform a hypothesis test that will determine whether the number of hourly workers in the City of Chicago is significantly different from 25% at the 95% confidence level.

In [73]:
# Your code here:

from statsmodels.stats.proportion import proportions_ztest
total = len(data)
hourly_workers = len(data_drop)
proportions_ztest(hourly_workers, total, value=.25)

(-3.1962453870335, 0.0013922864704323116)

In [74]:
result_total = "The Null Hypothesis (H0) that the proportion of workers is equal to 25% can be rejected based on a low p-value (less than 0.05). Although the test statistic suggests that it may be less, there is uncertainty regarding this conclusion."

In [75]:
result_total

'The Null Hypothesis (H0) that the proportion of workers is equal to 25% can be rejected based on a low p-value (less than 0.05). Although the test statistic suggests that it may be less, there is uncertainty regarding this conclusion.'